mybench/kv-transfer-measurement/20260614_134131_decode_con32/benchmark_output.txt
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model=None, served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='./mybench/kv-transfer-measurement/20260614_134131/benchmark_results.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:8000/v1/models to become ready...
Server ready in 0.0s.
Fail to load tokenizer config with error=Can't load tokenizer for 'qwen/qwen3.5-27b-fp8'. If you were trying to load it from 'https://huggingface.co/models', make sure you don't have a local directory with the same name. Otherwise, make sure 'qwen/qwen3.5-27b-fp8' is the correct path to a directory containing all relevant files for a Qwen2Tokenizer tokenizer.

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random-ids', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='qwen/qwen3.5-27b-fp8', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=512, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='./mybench/kv-transfer-measurement/20260614_134131/benchmark_results.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

Downloading Model from https://www.modelscope.cn to directory: /root/.cache/modelscope/hub/models/qwen/qwen3.5-27b-fp8
#Input tokens: 209281
#Output tokens: 25820
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     100       
Benchmark duration (s):                  66.90     
Total input tokens:                      209281    
Total input text tokens:                 209281    
Total generated tokens:                  25820     
Total generated tokens (retokenized):    25824     
Request throughput (req/s):              1.49      
Input token throughput (tok/s):          3128.43   
Output token throughput (tok/s):         385.97    
Peak output token throughput (tok/s):    560.00    
Peak concurrent requests:                37        
Total token throughput (tok/s):          3514.40   
Concurrency:                             26.75     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   17892.56  
Median E2E Latency (ms):                 17795.21  
P90 E2E Latency (ms):                    25432.77  
P99 E2E Latency (ms):                    30749.58  
---------------Time to First Token----------------
Mean TTFT (ms):                          9593.32   
Median TTFT (ms):                        9602.79   
P99 TTFT (ms):                           17950.48  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.57     
Median TPOT (ms):                        32.17     
P99 TPOT (ms):                           33.64     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           32.28     
Median ITL (ms):                         32.72     
P95 ITL (ms):                            34.85     
P99 ITL (ms):                            37.82     
Max ITL (ms):                            83.26     
==================================================